'''
문제설명
공항에는 G개의 탑승구가 있으며, 각각의 탑승구는 1번부터 G번까지 번호로 구분된다. 공항에는 P개의 비행기가 차례대로 도착할 예정이며, 
i
번째 비행기를 1번부터 
g
i
(1 <= 
g
i
 <= G) 탑승구 중 하나에 영구적으로 도킹하려 한다. 이 때, 다른 비행기가 도킹하지 않은 탑승구에만 도킹이 가능하다. 또한 P개의 비행기를 순서대로 도킹하다가 만약에 어떠한 탑승구에도 도킹할 수 없는 비행기가 나오는 경우, 그 시점에서 공항의 운행을 중단한다. 공항의 관리자는 최대한 많은 비행기를 공항에 도킹하고자 한다. 비행기를 최대 몇 대 도킹할 수 있는지를 출력해라

입력조건
첫째 줄에는 탑승구의 수 G(1 <= G <= 100,000)가 주어진다.
둘째 줄에는 비행기의 수 P(1 <= P <= 100,000)가 주어진다.
다음 P개의 줄에는 각 비행기가 도킹할 수 있는 탑승구의 정보 
g
(1 <= 
g
 <= G)가 주어진다. 이는 
i
번째 비행기가 1번부터 
g
i
번째(1 <= 
g
i
 <= G) 탑승구 중 하나에 도킹할 수 있다는 의미이다.
출력조건
첫째 줄에 도킹할 수 있는 비행기의 최대 개수를 출력해라.
'''
g = int(input())
p = int(input())

data = set()
for _ in range(p):
    data.add(int(input()))

print(len(data))